CircuitMess/Arduino-ESP32/boards.txt
circuitpet.menu.DebugLevel.none=None
circuitpet.menu.DebugLevel.none.build.code_debug=0

circuitpet.bootloader.tool=cpetfirm
circuitpet.bootloader.tool.firmware=circuitpet/firmware.bin

##############################################################

batctrl.name=BatController by CircuitMess

batctrl.vid.0=0x1a86
batctrl.pid.0=0x7523

batctrl.upload.tool=esptool_py
batctrl.upload.maximum_size=1310720
batctrl.upload.maximum_data_size=327680
batctrl.upload.wait_for_upload_port=false

batctrl.serial.disableDTR=true
batctrl.serial.disableRTS=true

batctrl.build.mcu=esp32
batctrl.build.core=esp32
batctrl.build.variant=batctrl
batctrl.build.board=CM_BATCTRL

batctrl.build.f_cpu=240000000L
batctrl.build.flash_size=4MB
batctrl.build.flash_freq=40m
batctrl.build.flash_mode=dio
batctrl.build.boot=dio
batctrl.build.partitions=default
batctrl.build.defines=-DCIRCUITOS_LOVYANGFX -DLOVYAN_MANUAL -DTFT_OFF -DCIRCUITOS_NVS -DDCIRCUITOS_FREERTOS
batctrl.build.extra_flags=-O2 -g

batctrl.menu.PartitionScheme.min_spiffs=No OTA
batctrl.menu.PartitionScheme.min_spiffs.build.partitions=noota_3g
batctrl.menu.PartitionScheme.min_spiffs.upload.maximum_size=1048576
batctrl.menu.PartitionScheme.min_spiffs.upload.binary_start=0x10000
batctrl.menu.PartitionScheme.min_spiffs.upload.spiffs_start=0x111000

batctrl.menu.FlashFreq.80=80MHz
batctrl.menu.FlashFreq.80.build.flash_freq=80m

batctrl.menu.UploadSpeed.921600=921600
batctrl.menu.UploadSpeed.921600.upload.speed=921600
batctrl.menu.UploadSpeed.115200=115200
batctrl.menu.UploadSpeed.115200.upload.speed=115200
batctrl.menu.UploadSpeed.256000.windows=256000
batctrl.menu.UploadSpeed.256000.upload.speed=256000
batctrl.menu.UploadSpeed.230400.windows.upload.speed=256000
batctrl.menu.UploadSpeed.230400=230400
batctrl.menu.UploadSpeed.230400.upload.speed=230400
batctrl.menu.UploadSpeed.460800.linux=460800
batctrl.menu.UploadSpeed.460800.macosx=460800
batctrl.menu.UploadSpeed.460800.upload.speed=460800
batctrl.menu.UploadSpeed.512000.windows=512000
batctrl.menu.UploadSpeed.512000.upload.speed=512000

batctrl.menu.DebugLevel.none=None
batctrl.menu.DebugLevel.none.build.code_debug=0

batctrl.bootloader.tool=batcfirm
batctrl.bootloader.tool.firmware=batctrl/firmware.bin


